app/views/employees/_form.html.erb

    <%= f.label :location_id %><br>
    <%= f.collection_select(:location_id, Location.all, :id, :site_code) %>
---
SELECT "locations".* FROM "locations"