app/views/assets/_form.html.erb

SELECT "employees".* FROM "employees"
---
      <td><strong>Assigned Employee</strong></td>
      <td><%= builder.collection_select(:employee_id, Employee.all, :id, :name,{:prompt => 'Select'}) %></td>

SELECT "locations".* FROM "locations"
---
      <td><strong>Assigned Location</strong></td>
      <td><%= builder.collection_select(:location_id, Location.all, :id, :site_code,{:prompt => 'Select'}) %></td>