app/views/assets/index.html.erb

        <td><%= asset.model %></td>
        <td><%= if asset.transfers.last
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."asset_id" = ?  ORDER BY "transfers"."id" DESC LIMIT 1  [["asset_id", 1]]