app/views/assets/show.html.erb

      <td><strong>Assigned to</strong></td>
      <td><%= if @asset.transfers.last
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."asset_id" = ?  ORDER BY "transfers"."id" DESC LIMIT 1  [["asset_id", 1]]

      <td><%= if @asset.transfers.last
 				@asset.transfers.last.location.country + ' ' +  @asset.transfers.last.location.city + ' ' + @asset.transfers.last.location.site_code
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 4]]
SELECT "transfers".* FROM "transfers" WHERE "transfers"."asset_id" = ?  [["asset_id", 1]]