app/controllers/assets_controller.rb

SELECT  "assets".* FROM "assets" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "assets"
---
  def index
    @assets = Asset.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "assets" ("asset_type", "asset_tag", "serial_nr", "po", "price", "lifecycle", "make", "model", "is_used", "is_assigned", "is_supported", "po_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @asset = Asset.new(asset_params)

    respond_to do |format|
      if @asset.save

UPDATE "assets" SET "po_date" = ?, "updated_at" = ? WHERE "assets"."id" = ?  [["po_date", "2011-01-01"], ["updated_at", "2015-02-03 20:22:08.328593"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @asset.update(asset_params)

SELECT  "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_asset
      @asset = Asset.find(params[:id])