app/controllers/employees_controller.rb

  def index
    @employees = Employee.paginate(:page => params[:page], :per_page => 30)
---
SELECT  "employees".* FROM "employees" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "employees"

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("username", "name", "job_title", "email", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)