app/controllers/locations_controller.rb

SELECT  "locations".* FROM "locations" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "locations"
---
  def index
    @locations = Location.paginate(:page => params[:page], :per_page => 30)

INSERT INTO "locations" ("country", "city", "site_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["country", "Ireland"], ["city", "Dublin"], ["site_code", "DUB12"], ["address", "First Address"], ["created_at", "2015-02-01 15:47:30.872046"], ["updated_at", "2015-02-01 15:47:30.872046"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "site_code" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["site_code", "DUB1"], ["updated_at", "2015-02-01 15:48:26.857634"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)