app/controllers/register_controller.rb

SELECT "assets".* FROM "assets"
---
  def index
  	@registry = Asset.all