app/controllers/register_controller.rb

SELECT "assets".* FROM "assets" WHERE "assets"."id" IN (NULL, NULL)
---
    def set_asset
      @asset = Asset.find(params[:id])