app/controllers/transfers_controller.rb

  def index
    @transfers = Transfer.paginate(:page => params[:page], :per_page => 30)
---
SELECT  "transfers".* FROM "transfers" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "transfers"

  def create
    @transfer = Transfer.new(transfer_params)

    respond_to do |format|
      if @transfer.save
---
INSERT INTO "transfers" ("asset_id", "employee_id", "location_id", "room", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["asset_id", 1], ["employee_id", 2], ["location_id", 3], ["room", "3"], ["date", "2015-02-01"], ["created_at", "2015-02-01 17:30:42.358904"], ["updated_at", "2015-02-01 17:30:42.358904"]]

  def destroy
    @transfer.destroy
---
DELETE FROM "transfers" WHERE "transfers"."id" = ?  [["id", 2]]

    def set_transfer
      @transfer = Transfer.find(params[:id])
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = ? LIMIT 1  [["id", 2]]