app/views/transfers/_form.html.erb

SELECT "assets".* FROM "assets"
---
    <%= f.label :asset_id %><br>
    <%= f.collection_select(:asset_id, Asset.all, :id, :asset_tag) %>

SELECT "employees".* FROM "employees"
---
    <%= f.label :employee_id %><br>
    <%= f.collection_select(:employee_id, Employee.all, :id, :name) %>

SELECT "locations".* FROM "locations"
---
    <%= f.label :location_id %><br>
    <%= f.collection_select(:location_id, Location.all, :id, :site_code) %>